// Аритметички оператори  -  +, -, *, /, %, ++, -- "једино плус ради и са стринговима а сви остали само са бројевима"
// +, -, *, /, %  ово су бинарни оператори - то значи да раде са два броја
console.log("5 + 3 =" , 5 + 3);
// ...
console.log("Испод је у ноде-у проценти од 0 - 10")
// %  проценат се у нодеу приказује као остатак при дељењу са неким бројем

console.log("0 % 3 =" , 0 % 3); // остатак је 0
console.log("1 % 3 =" , 1 % 3); // 1 / 3 је 1 а остатак у ноду је 2
console.log("2 % 3 =" , 2 % 3); // 2 / 3 је 1 а остатак у ноду је 2
console.log("3 % 3 =" , 3 % 3); // 3 / 3 = 1, 0 остатак је нула
console.log("4 % 3 =" , 4 % 3); // 4 / 3 = 1, 1 остатак је један
console.log("5 % 3 =" , 5 % 3); // 5 / 3 = 1, 2 остатак је два
console.log("6 % 3 =" , 6 % 3); // 6 / 3 = 2, 0 остатак је нула
console.log("7 % 3 =" , 7 % 3); // 7 / 3 = 2, 1 остатак је један
console.log("8 % 3 =" , 8 % 3); // 8 / 3 = 2, 2 остатак је два
console.log("9 % 3 =" , 9 % 3); // 9 / 3 је 3, 0 остатак у ноду је 0
console.log("10 % 3 =" , 10 % 3); // 10 / 3 = 3, 1 остатак је један

// Жутим у ноде-у је обележен БРОЈ а белим СТРИНГ
console.log("Лунарни оператори ++, --")
// ++  и -- су Лунарни оператори
console.log("пример са ++")
///
{
    let x = 5;
    x++
    console.log("x je:" , x)
}
///
console.log("пример са --")
///
{
    let x = 5;
    x--
    console.log("x je:" , x)
}

// варијаблу x унутар console.log(x) он прво израчуна па испише, па гледа шта има даље и то упише у направљену кућицу за тај број односно упише нови број
console.log("пример са x++ унутар console.log(x++)")
///
{
    let x = 5;
    console.log("x je:" , x++)
    console.log(x, " је заправо у кућици после исписа, јер урачуна после ++ и дода у кућицу")
}
///
{
    let x = 5;
    console.log("x je:" , x++); // Post increment

    let y = x++;
    console.log(y , x);
}
///
{
    let x = 5;
    console.log("x je:" , ++x); // Pre increment

    let y = ++x;
    console.log(y , x);
}

{
    let x = 5
    let y = ++x
    ///  Ово изнад и ово испод исто значе
    // let x = 5
    // x = x + 1
    // let y = x
}



// typeof оператор

// Оператори поређења

// Логички оператори

// Оператори доделе

console.log("Браво за вежбање!!!")