    ///оператор доделе = има последњи приоритет
    ///дакле прво ће се извршити множење па сабирање па додела = 
{
    let x = 5 + 3 * 42
}

console.log("Браво за вежбање!!!");

/// Ипак ове операторе доделе морам да гуглам на нету јер нису уснимљени

/// JavaScript Assignment Operators

///Operator	Example	Same As
//Operator..Example.....Same As
// =	    x = y	    x = y
// +=	    x += y	    x = x + y
// -=	    x -= y	    x = x - y
// *=	    x *= y	    x = x * y
// /=	    x /= y	    x = x / y
// %=	    x %= y	    x = x % y
// **=	    x **= y	    x = x ** y

{
    let x = 5;
    let y = x;
    console.log(x,y)

    x += y;
    console.log(x,y)
    x += y;
    console.log(x,y)
}

{
    let g = 9.81;
    let t = 90;
    t /= g;
    console.log(g,t)
}

/// Дакле оператори доделе - где желимо да декларишемо нову вредност првој варијабли,
/// се пише тако што увек иде знак операције + - * / % ** па тек онда знак =
/// знак = као што је речено долази последњи, дакле израчунамо вредност без =
/// а након тога само доделимо вредност првој варијабли јер је то и поента рачунске операције

{
    let p = 8
    let j = 5
    let l = p + j
    console.log(p,j++,l)
    console.log(p,++j,l)

    let v = 5
    v *= p * j
    console.log(v)
    /// typeof оператор - number , string или  boolean
    console.log(typeof v)
    /// Оператори поређења -  < , > , <= , >= , ==, ===, !=, !==  а добија се или true или false
    console.log(v > p + j)
    console.log(v >= p + j)
    console.log(v != p + j)
    console.log(v !== p + j)
    /// заграда у загради а испред тога НЕ као ! узвичник
    console.log ( !(v == p + j) ) /// овај је већ логички оператор НЕ који се обележава са ! а добија се опет true/falce
////////////////// Логички оператори  -   && ово значи "И"   ,   || ово значи "ИЛИ" или гледа да ли је било који однос тачан и даће TRUE , ! ово значи "НЕ"
console.log("Испиши логичке операторе && || !")
    
console.log ((v > p + j) && (v !== p + j) )
console.log ((v > p + j) || (v == p + j) )

}