// Написати програм који за унете параметре
//  Рачуна и испише обим и површину следећих фигура:
// Круг, Правоугаоник, Квадрат


///  ОБИМ И ПОВРШИНА КРУГА
{
    let r = 12;
    let O, P;
    O = 2 * r * Math.PI
    P = r * r * Math.PI
    console.log(O, P)
}

/// ОБИМ И ПОВРШИНА ПРАВОУГАОНИКА
{
    let x, y;
    let O, P;
    x = 5;
    y = 2 * x;
    O = x * 2 + y * 2;
    P = x * y
    console.log("Обим Правоугаоника", O,"центиметара", "Површина Правоугаоника",P,"цм2")
}


/// ОБИМ И ПОВШИНА КВАДРАТА
{
    let s;
    s = 5;
    let O, P;
    O = s * 4;
    P = s * s;
    console.log("Обим Квадрата", O,"центиметара", "Површина Квадрата",P,"цм2")

}

{
    let r = 10
    if(r >= 0){
        let O, P;
        O = 2 * r * Math.PI;
        P = r * r * Math.PI;
        console.log(O, P)
    }
    else{
    console.log("крај програма")
    }
}



console.log("Браво за вежбање!!!")