/// Math.pow(2,3)   - први број је само број односно број два 2, а други број у загради је у преводу НА ТРЕЋИ СТЕПЕН - што је 2*2*2+8
/// 2 ** 3        - ово је исти код као горе - са две звездице се пише када желимо нешто НА СТЕПЕН и исто је НА ТРЕЋИ СТЕПЕН односно 2*2*2+8
/// Трећи начин је ПЕТЉА

/// Provera da li je neka godina prestupna

/// x дељив са y
/// x % y      - па ако је резултат 0 онда значи да је дељив јер нема остатка


/// Ако није дељив са 4, онда је обична годинаа
/// Ако је дељива са 4, и није дељива са 100, онда је преступна
/// Ако је дељива са 4 и није са 400, онда је обична

/// Или можемо да поставимо овако исти задатак лакше
/// Када је година преступна:

/// број године дељив са четири, и
/// важи једно од следећа два:
/// број године није дељив са 100
/// број године је дељив са 400

{
    let godina = 1986

    if(godina % 4 === 0 && (godina % 100 !== 0 || godina % 400 === 0)){
        console.log(`Година ${godina} јесте преступна`)
    }
    else{
        console.log(`Година ${godina} није преступна`)
    }
}

console.log("Задатак са месецима и данима и преступним годинама са SWICH")
{
    let mesec = 1
    let godina = 1986
    switch(mesec){
        case 0:
        case 2:
        case 4:
        case 6:
        case 7:
        case 9:
        case 11:
            console.log("Месец има 31 дан.")
            break
        case 1:
            if(godina % 4 === 0 && (godina % 100 !== 0 || godina % 400 === 0)){
                console.log("Фебруар има 29 дана")
            }
            else{
                console.log("Фебруар има 28 дана")
            }
            break
        case 3:
        case 5:
        case 8:
        case 10:
        
            console.log("Месец има 30 дана.")
            break
        default:
            console.log("Није валидан унос, мора да буде број месеца од 0 - 11")
            break
    }
}

console.log("Задатак са месецима и данима и преступним годинама са IF ELSE")

{
    let godina = 1986
    let mesec = 1

    if(mesec === 0 || mesec === 2 || mesec === 4 || mesec === 6 || mesec === 7 || mesec === 9 || mesec === 11){
        console.log("Месец има 31 дан.")
        }
    else if(mesec === 1){
        if(godina % 4 === 0 && (godina % 100 !== 0 || godina % 400 === 0)){
            console.log("Фебруар има 29 дана.")
        }
        else{
            console.log("Фебруар има 28 дана.")
        }

    }
    else if(mesec === 3 || mesec === 5 || mesec === 8 || mesec === 10){
        console.log("Месец има 30 дана.")
    }
}


console.log("БРАВО ПРЕДРАЖЕ ЗА ОВО ВЕЖБАЊЕ")