/////////////////// typeof оператор

{
  let x = 5;
  console.log(typeof x);
  /// исписаће Number
}

{
  let x = 5;
  console.log(typeof x);
  /// исписаће Number

  x = "Hello world";
  console.log("x je:", typeof x);
  /// Исписаће икс је стринг

  x = true;
  console.log("x je:", typeof x);
  /// Исписаће x је boolean

  let y = "5";
  let z = 3;
  console.log(typeof (y + z));
  /// Исписаће да је СТРИНГ
}

//////////////////// Оператори поређења -  < , > , <= , >= , ==, ===, !=, !==

/// два пута једнако == је у ствари ЈЕДНАКО јер знак једном једнако је у ствари оператор доделе а не поређења
/// три пута једнако === је једнако али додатно проверава и тип - Number, String, Boolean
/// != НИЈЕ ЈЕДНАКО а !==  није једнако (ЈЕ РАЗЛИЧИТО)

{
  console.log("5 < 3", 5 < 3);
  console.log("5 > 3", 5 > 3);
  console.log("5 <= 3", 5 <= 3);
  console.log("5 >= 3", 5 >= 3);
  console.log("5 == 3", 5 == 3);
  console.log("5 === 3", 5 === 3);
  console.log("5 != 3", 5 != 3);
  console.log("5 !== 3", 5 !== 3);
  /////
  console.log("следећи пример");
  /////
  console.log("3 < 3", 3 < 3);
  console.log("3 <= 3", 3 <= 3);
  /////
  console.log("следећи пример");
  /////
  console.log("3 == 3", 3 == 3);
  console.log("3 === 3", 3 === 3); // Додатно проверава тип
  console.log("'3' == 3", "3" == 3); // Покушаваће да упореди и претвори стринг или број и овде је тачно да су исти
  console.log("'3' == 3", "3" === 3); // Нису исти јер им је у старту тип различит
  /////
  console.log("следећи пример са операторем поређења НИЈЕ ЈЕДНАКО");
  /////
  console.log("3 != 3", 3 != 3);
  console.log("3 !== 3", 3 !== 3);
  console.log("'3' != 3", "3" != 3);
  console.log("'3' !== 3", "3" !== 3);
}
  

////////////////// Логички оператори  -   && ово значи "И"   ,   || ово значи "ИЛИ" или гледа да ли је било који однос тачан и даће TRUE , ! ово значи "НЕ"
///// && "И" ИМА ПРЕДНОСТ У ИЗВРШАВАЊУ У ОДНОСУ НА "ИЛИ"
console.log("следећи пример - Логички оператори");
/////
{
    let a = 5, b = 3
    let c = 3

    console.log("!(5 == 5)" , !(5 == 5))
    console.log("(a >= b) && (c == b)", (a >= b) && (c == b))
}

// Оператори доделе    = , += , -= , /= , %=

{
    let x = 5 + 3 * 42;
    ///оператор доделе = има последњи приоритет
    ///дакле прво ће се извршити множење па сабирање па додела = 
}

console.log("Браво за вежбање!!!");
